ShaYJ555/freertos_lvgl/board/pin_mux.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: MIMXRT1021xxxxx
package_id: MIMXRT1021DAG5A
mcu_data: ksdk2_0
processor_version: 5.0.2
board: MIMXRT1020-EVK
pin_labels:
- {pin_num: '93', pin_signal: GPIO_AD_B0_15, label: 'LCD_DC_GPIO_PIN/U11[25]/J19[2]', identifier: ENET_TXD1;LCD_DC_GPIO_PIN}
power_domains: {NVCC_GPIO: '3.3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"
#include "fsl_xbara.h"
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '101', peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_07, software_input_on: Disable}
  - {pin_num: '105', peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_06, software_input_on: Disable}
  - {pin_num: '93', peripheral: GPIO1, signal: 'gpio_io, 15', pin_signal: GPIO_AD_B0_15, identifier: LCD_DC_GPIO_PIN, direction: OUTPUT, software_input_on: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */
  CLOCK_EnableClock(kCLOCK_Xbar1); 

  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_30_GPIO2_IO30, 0U);  /* 触摸中断引脚 */
  LPSPI2_InitPins();
  LPSPI4_InitPins();
  ENC_InitPins();
  // LCD BackLight PWM
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_31_FLEXPWM2_PWMB02, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_31_FLEXPWM2_PWMB02, 0x10B0U);
  // Heater PWM
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_FLEXPWM2_PWMB03, 0U);
  IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_29_FLEXPWM2_PWMB03, 0x10B0U);  
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI4_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI4_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_32_LPSPI4_SCK,        /* GPIO_AD_B0_10 is configured as LPSPI1_SCK */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B0_10 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_33_LPSPI4_PCS0,       /* GPIO_AD_B0_11 is configured as LPSPI1_PCS0 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B0_11 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_34_LPSPI4_SDO,        /* GPIO_AD_B0_12 is configured as LPSPI1_SDO */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B0_12 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_35_LPSPI4_SDI,        /* GPIO_AD_B0_13 is configured as LPSPI1_SDI */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B0_13 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_37_LPSPI4_PCS2,
      1U);
  
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_32_LPSPI4_SCK,        /* GPIO_AD_B0_10 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_33_LPSPI4_PCS0,       /* GPIO_AD_B0_11 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_37_LPSPI4_PCS2,
      0x10B0U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_34_LPSPI4_SDO,        /* GPIO_AD_B0_12 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_35_LPSPI4_SDI,        /* GPIO_AD_B0_13 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
}


