ShaYJ555/freertos_lvgl/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI4_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI4_DeinitPins(void) {

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_32_GPIO3_IO00,        /* GPIO_AD_B0_10 is configured as GPIO1_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_33_GPIO3_IO01,        /* GPIO_AD_B0_11 is configured as GPIO1_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_34_GPIO3_IO02,        /* GPIO_AD_B0_12 is configured as GPIO1_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_35_GPIO3_IO03,        /* GPIO_AD_B0_13 is configured as GPIO1_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_37_GPIO3_IO05,        /* GPIO_AD_B0_13 is configured as GPIO1_IO13 */
      0U);    
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI2_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI2_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_10_LPSPI2_SCK,        /* GPIO_AD_B0_10 is configured as LPSPI1_SCK */
      0U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B0_10 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_12_LPSPI2_SDO,        /* GPIO_AD_B0_12 is configured as LPSPI1_SDO */
      0U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B0_12 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_13_LPSPI2_SDI,        /* GPIO_AD_B0_13 is configured as LPSPI1_SDI */
      0U);                                          /* Software Input On Field: Force input path of pad GPIO_AD_B0_13 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_11_LPSPI2_PCS0,
      0U);  
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_14_LPSPI2_PCS1,
      0U);  

  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_10_LPSPI2_SCK,        /* GPIO_AD_B0_10 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_12_LPSPI2_SDO,        /* GPIO_AD_B0_12 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_13_LPSPI2_SDI,        /* GPIO_AD_B0_13 PAD functional properties : */
      0x10B0U);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_11_LPSPI2_PCS0,
      0x10B0U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_14_LPSPI2_PCS1,
      0x10B0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI2_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI2_DeinitPins(void) {

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_10_GPIO2_IO10,        /* GPIO_AD_B0_10 is configured as GPIO1_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_12_GPIO2_IO12,        /* GPIO_AD_B0_11 is configured as GPIO1_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_13_GPIO2_IO13,        /* GPIO_AD_B0_12 is configured as GPIO1_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_11_GPIO2_IO11,
      0U);
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_14_GPIO2_IO14,
      0U);  
}


